src/Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Цены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УстановкаЦен/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Номенклатура <> Неопределено Тогда
		ТекущаяЦена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
		ИзмененнаяСтрока.Цена = ТекущаяЦена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.Цены.ТекущиеДанные; 
	ПриИзмененииНоменклатуры(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Подбор = Новый Структура;
	Подбор.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", Подбор, Элементы.Цены);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НоменклатураЕсть = Ложь;
	
	Для Каждого ТекСтрока Из Объект.Цены Цикл
		Если ТекСтрока.Номенклатура = ВыбранноеЗначение Тогда
			НоменклатураЕсть = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не НоменклатураЕсть Тогда
		НоваяСтрока = Объект.Цены.Добавить();
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;
		ПриИзмененииНоменклатуры(НоваяСтрока);
	КонецЕсли;
	
	
КонецПроцедуры
